# Images data
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "@DATAPATH@"
    backend: LMDB
    batch_size: 64
  }
  transform_param {
    crop_size: 227
    mirror: false
    mean_value: 104
    mean_value: 117
    mean_value: 123
    # scale: 0.0039
  }
}
